//-----------------------------------------------task1----------------------------------------------
//На HTML-сторінці розміщено кнопку та поле вводу. Через 3 секунди
// після натиснення на кнопку (використати таймер) має з’явитись
// інформаційне вікно (alert) з змістом рядка вводу. Після закриття
// діалогового вікна рядок має бути пустим.
let button = document.getElementById('btn');

button.addEventListener("click", ev => {
    let text = document.getElementById('inputText');
    setTimeout(() => {
        alert(text.value);
        text.value = ""
    }, 3000)
    ev.preventDefault();
})


//-----------------------------------------------task2----------------------------------------------
//Через 3 секунди після відкриття фоновий колір  html-сторінки має змінитись з білого не рожевий
setTimeout(()=>{
    document.body.style.backgroundColor='pink';
},3000)


//-----------------------------------------------task3----------------------------------------------
//На HTML-сторінці розміщено  кнопку. Використовуючи таймер
// реалізувати, щоб при натисканні на кнопку одночасно у заголовку вікна
// та в інформаційному вікні (alert) з’являлось прізвище та ім’я.
let name= 'Diana Makovetska';
let button2 = document.getElementById('btn2');

button2.onclick=()=>{
    document.title=name;
    alert(name);
}
//-----------------------------------------------task4----------------------------------------------
//Через 3 секунди після відкриття в браузері має з’явитись діалогове вікно
// comfirm, яке запропонує закрити поточне вікно. При натисканні на
// кнопку ОК – поточне вікно має закритись.
setTimeout(()=>{
    if(confirm(' закрити поточне вікно?')){
        window.close();
    }
},3000)